import Icon from "@/components/ui/icon";
import Image from "next/image";
import { RiHeart2Line, RiHeartLine, RiShareLine } from "react-icons/ri";

const MagazinePost = () => {
  return (
    <div className="flex w-full max-w-screen-3xl flex-col gap-12 px-5 lg:px-20">
      <div className="flex flex-col gap-3">
        <h1 className="text-[40px] font-bold leading-normal">نام مقاله</h1>

        <div className="flex items-center">
          <div className="flex w-full items-center gap-9 text-xl">
            <p>نام نویسنده مقاله</p>
            <p>... / .../ .....</p>
          </div>

          <div className="flex items-center gap-9 text-primary">
            <button>
              <Icon className="text-[24px]" icon={RiHeartLine} />
            </button>
            <button>
              <Icon className="text-[24px]" icon={RiShareLine} />
            </button>
          </div>
        </div>
      </div>

      <div className="relative aspect-square w-full lg:aspect-[128/60]">
        <Image
          className="rounded-3xl object-cover"
          unoptimized
          src={"/visuals/about-us/pic4.png"}
          alt=""
          fill
        />
      </div>

      <p className="text-xl">
        متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.
      </p>

      <div className="flex grid-cols-2 flex-col gap-9 lg:grid lg:gap-20">
        <div className="relative aspect-video w-full lg:aspect-square">
          <Image
            className="rounded-3xl object-cover"
            src={"/visuals/about-us/pic4.png"}
            alt=""
            unoptimized
            fill
          />
        </div>

        <p className="text-xl">
          متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
          مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله
          در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این
          قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
          نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.
        </p>
      </div>

      <p className="text-xl">
        متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.
      </p>

      <div className="flex grid-cols-2 flex-col gap-9 lg:grid lg:gap-20">
        <div className="relative aspect-video w-full lg:aspect-square">
          <Image
            className="rounded-3xl object-cover"
            src={"/visuals/about-us/pic4.png"}
            alt=""
            unoptimized
            fill
          />
        </div>

        <p className="order-1 text-xl">
          متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
          مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله
          در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این
          قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
          نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
          شود.متن مقاله در این قسمت نوشته شود.
        </p>
      </div>

      <p className="text-xl">
        متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در
        این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت
        نوشته شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته
        شود.متن مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.متن
        مقاله در این قسمت نوشته شود.متن مقاله در این قسمت نوشته شود.
      </p>
    </div>
  );
};

export default MagazinePost;
